In [47]:
import pandas as pd
# create a dataframe


df = pd.DataFrame({
    'Name' : ['a', 'b', 'c'],
    'Values': [[1,2,3], [2,0,1], [3,2,0]]
})

In [48]:
df

  Name     Values
0    a  [1, 2, 3]
1    b  [2, 0, 1]
2    c  [3, 2, 0]

In [49]:
df['Values'].tolist()

[[1, 2, 3], [2, 0, 1], [3, 2, 0]]

In [50]:
pd.DataFrame(df['Values'].tolist())

   0  1  2
0  1  2  3
1  2  0  1
2  3  2  0

In [38]:
df[["col1","col2","col3"]] = pd.DataFrame(df['Values'].tolist())
df

  Name     Values  col1  col2  col3
0    a  [1, 2, 3]     1     2     3
1    b  [2, 0, 1]     2     0     1
2    c  [3, 2, 0]     3     2     0

In [42]:
df1 = pd.DataFrame(df['Values'].tolist(),columns=["col1","col2","col3"])

In [43]:
df1

   col1  col2  col3
0     1     2     3
1     2     0     1
2     3     2     0

In [44]:
df

  Name     Values
0    a  [1, 2, 3]
1    b  [2, 0, 1]
2    c  [3, 2, 0]

In [46]:
pd.concat([df,df1],axis=1)

  Name     Values  col1  col2  col3
0    a  [1, 2, 3]     1     2     3
1    b  [2, 0, 1]     2     0     1
2    c  [3, 2, 0]     3     2     0

In [23]:
df = pd.DataFrame({
    'Address': ['4860 Sunset Boulevard,San Francisco,California',
                '3055 Paradise Lane,Salt Lake City,Utah',
                '682 Main Street,Detroit,Michigan',
                '9001 Cascade Road,Kansas City,Missouri']
})
# display the dataframe
df

                                          Address
0  4860 Sunset Boulevard,San Francisco,California
1          3055 Paradise Lane,Salt Lake City,Utah
2                682 Main Street,Detroit,Michigan
3          9001 Cascade Road,Kansas City,Missouri

In [26]:
# split column into multiple columns by delimiter 
df = df['Address'].str.split(',',expand=True)

In [27]:
df.columns = ["Street","City","State"]
df

                  Street            City       State
0  4860 Sunset Boulevard   San Francisco  California
1     3055 Paradise Lane  Salt Lake City        Utah
2        682 Main Street         Detroit    Michigan
3      9001 Cascade Road     Kansas City    Missouri

In [28]:
df.Street.tolist()

['4860 Sunset Boulevard',
 '3055 Paradise Lane',
 '682 Main Street',
 '9001 Cascade Road']

In [96]:
#df = pd.read_excel("C:/Users/skesh/Desktop/sample_file.xlsx",sheet_name="Detail_Sheet_F001")
df = pd.read_excel("C:/Users/skesh/Desktop/sample_file.xlsx",sheet_name=0)

df

  User Name First Name Last Name  User Lock Status  F-90  F-91  M-01
0     RUREN        Ren    Ruoxin                 0     3     1     1

In [97]:
df = df.set_index(['User Name',
                   'First Name',
                   'Last Name',
                   'User Lock Status']).stack().reset_index().rename(columns = {'level_4':'Category',
                                                                               0:'Score'})

df

  User Name First Name Last Name  User Lock Status Category  Score
0     RUREN        Ren    Ruoxin                 0     F-90      3
1     RUREN        Ren    Ruoxin                 0     F-91      1
2     RUREN        Ren    Ruoxin                 0     M-01      1

In [105]:
sheetnames = pd.ExcelFile("C:/Users/skesh/Desktop/sample_file.xlsx").sheet_names

master_df = pd.DataFrame()
master_df

Empty DataFrame
Columns: []
Index: []

In [106]:
for sheet in sheetnames:
    
    df = pd.read_excel("C:/Users/skesh/Desktop/sample_file.xlsx",sheet_name=sheet)
    
    df1 = df.set_index(['User Name',
                   'First Name',
                   'Last Name',
                   'User Lock Status']).stack().reset_index().rename(columns = {'level_4':'Category',
                                                                               0:'Score'})
    
    master_df = pd.concat([master_df,df1])
    
    print(sheet)

Detail_Sheet_F001
Detail_Sheet_F002
Detail_Sheet_F004
Detail_Sheet_F005
Detail_Sheet_F006
Detail_Sheet_F007
Detail_Sheet_F008
Detail_Sheet_F009
Detail_Sheet_F010
Detail_Sheet_F011
Detail_Sheet_F012
Detail_Sheet_F013
Detail_Sheet_F014
Detail_Sheet_F015
Detail_Sheet_F016
Detail_Sheet_F017
Detail_Sheet_F018
Detail_Sheet_F019
Detail_Sheet_F020
Detail_Sheet_F021
Detail_Sheet_F024
Detail_Sheet_F025
Detail_Sheet_F026
Detail_Sheet_F027
Detail_Sheet_F028
Detail_Sheet_F029
Detail_Sheet_F030
Detail_Sheet_F032
Detail_Sheet_F033
Detail_Sheet_F035
Detail_Sheet_F036
Detail_Sheet_F037
Detail_Sheet_F038
Detail_Sheet_F039
Detail_Sheet_F040
Detail_Sheet_F041
Detail_Sheet_F042

In [109]:
master_df

   User Name First Name Last Name  User Lock Status Category  Score
0      RUREN        Ren    Ruoxin                 0     F-90    3.0
1      RUREN        Ren    Ruoxin                 0     F-91    1.0
2      RUREN        Ren    Ruoxin                 0     M-01    1.0
0      RUREN        Ren    Ruoxin                 0     F-90    3.0
1      RUREN        Ren    Ruoxin                 0     F-91    1.0
..       ...        ...       ...               ...      ...    ...
22     RUREN        Ren    Ruoxin                 0     FB50    3.0
23     RUREN        Ren    Ruoxin                 0     FBR2    1.0
24     RUREN        Ren    Ruoxin                 0   F-07.1    1.0
25     RUREN        Ren    Ruoxin                 0     F-53    2.0
26     RUREN        Ren    Ruoxin                 0     FBZ2    2.0

[768 rows x 6 columns]

In [84]:
df = df.set_index(['User Name', 'First Name', 'Last Name', 'User Lock Status'])
df

                                                 F-90  F-91  M-01
User Name First Name Last Name User Lock Status
RUREN     Ren        Ruoxin    0                    3     1     1

In [85]:
df.stack()

User Name  First Name  Last Name  User Lock Status
RUREN      Ren         Ruoxin     0                 F-90    3
                                                    F-91    1
                                                    M-01    1
dtype: int64

In [88]:
df = df.stack().reset_index().rename(columns = {'level_4':'Category',0:'Score'})
df

  User Name First Name Last Name  User Lock Status Category  Score
0     RUREN        Ren    Ruoxin                 0     F-90      3
1     RUREN        Ren    Ruoxin                 0     F-91      1
2     RUREN        Ren    Ruoxin                 0     M-01      1

In [123]:
df = pd.read_csv("PHR.Data.csv")

#df["QM_RESULT_ETL"].unique()

In [124]:
# 
df["New"] = pd.to_numeric(df["QM_RESULT_ETL"], errors='coerce')

In [134]:
#df[df["New"].isnull()][["New","QM_RESULT_ETL"]].QM_RESULT_ETL.unique()
#[["New","QM_RESULT_ETL"]].QM_RESULT_ETL.unique()

t = ['Equal or Less than Limit of Detection (LOD = 0.03%) ',
' 0.09% ', ' 0.09%',
' The retention time of the peak due to Domperidone in the chromatogram of the sample preparation.',
     0.12,230,12,1.12
]

In [136]:
df = pd.DataFrame(t)
df.columns = ["Col1"]